<a href="https://colab.research.google.com/github/ishizukamaaya/CARAVAN/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame([[1,2,3],[4,5,6,],[7,8,9]],
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [4]:
import numpy as np

In [5]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6,],[7,8,9]]),
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [6]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [7]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [15]:
df = pd.DataFrame([[1,2,3,],
                      [4,5,6],
                      [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
df.columns = ['col01', 'col02', 'col03']
df.index = ['idx01', 'idx02', 'idx03']

In [35]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [19]:
df.columns = ['col04', 'col05', 'col06']

In [20]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [24]:
df = df.rename(columns = {'col04': 'x'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [23]:
df = df.rename(columns = {'col05': 'y', 'col06': 'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [25]:
df = df.rename(index = {'idx01': 'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df['x']

In [27]:
type(df['x'])

pandas.core.series.Series

In [28]:
df[['x']]

       x
w      1
idx02  4
idx03  7

In [29]:
type(df[['x']])

pandas.core.frame.DataFrame

In [30]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [32]:
df.loc['idx02']

x    4
y    5
z    6
Name: idx02, dtype: int64

In [33]:
df.loc['w','y']

2

In [36]:
df.loc[:,'col01']

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [37]:
df.iloc[:,0]

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [38]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6,],[7,8,9]]),
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [39]:
df.loc['idx03','col02']

8

In [40]:
df.loc['idx03','col02'] = 100
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [41]:
df.loc[:,'col03'] = ['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido